public class zametki {
    
}


    
            // System.out.println(userRum);
        // System.out.println(userHdd);

        // System.out.println("Все ноутбуки c такими параметрами в наличии:");
        // Iterator<OurNotebook> iterator = set.iterator();
        // while (iterator.hasNext()) {
        //     OurNotebook element = iterator.next();
        //     if (element.ram >= userRum){
        //         if (element.hdd >= userHdd){
        //             System.out.println(element);
        //         }
        //     }        
        // }

        // Подумать над структурой класса Ноутбук для магазина техники - выделить поля и методы. Реализовать в java.
// Создать множество ноутбуков.
// Написать метод, который будет запрашивать у пользователя критерий (или критерии) фильтрации и выведет ноутбуки, отвечающие фильтру. 
// Критерии фильтрации можно хранить в Map. Например: “Введите цифру, соответствующую необходимому критерию:
// 1 - ОЗУ
// 2 - Объем ЖД
// 3 - Операционная система
// 4 - Цвет …
// Далее нужно запросить минимальные значения для указанных критериев - сохранить параметры фильтрации можно также в Map.
// Отфильтровать ноутбуки из первоначального множества и вывести проходящие по условиям.
